import { html, Component, render } from "../libs/htm.js";

const TermsOfService = () => { 
  return html`<div class="terms-container">
	<h4 class="terms-label">Введение</h4>
	<p class="terms-information">Обеспечение конфиденциальности и безопасности обработки персональных данных в Компании является одной из приоритетных задач организации.
		<br />В Компании для этих целей введен в действие комплект организационно-распорядительной документации, обязательный к исполнению всеми сотрудниками, допущенными к обработке персональных данных.
		<br />Обработка, хранение и обеспечение конфиденциальности и безопасности персональных данных осуществляется в соответствии с действующим законодательством РФ в сфере защиты персональных данных, и в соответствии с локальными актами Компании.
		<br />Настоящая Политика определяет принципы, порядок и условия обработки персональных данных работников Компании и потребителей услуг Компании, чьи персональные данные обрабатываются организацией, с целью обеспечения защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну, а также устанавливает ответственность должностных лиц Компании, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных.
		<br />Настоящая Политика в отношении обработки персональных данных в Компании (далее - Политика) разработана в соответствии с Федеральным законом от 27 июля 2006 г. № 152-ФЗ «О персональных данных».
	</p>
	<h4 class="terms-label">1. Понятие и состав персональных данных</h4>
	<p class="terms-information">Перечень персональных данных, подлежащих защите в Компании определятся следующими нормативными актами Российской Федерации:
	</p><p class="terms-information">- Федеральный закон от 27 июля 2006 г. № 152-ФЗ «О персональных данных»;</p>
	<p class="terms-information">- Федеральный закон от 30 декабря 2001 года № 197-ФЗ «Трудовой кодекс Российской федерации»;</p>
	<p class="terms-information">- Федеральный закон от 06 декабря 2001 года № 402-ФЗ «О бухгалтерском учёте»;</p>
	<p class="terms-information">- Налоговый кодекс Российской Федерации;</p>
	<p class="terms-information">- Гражданский Кодекс Российской Федерации;</p>
	<p class="terms-information">- Федеральный закон от 01 апреля1996 N 27-ФЗ «Об индивидуальном (персонифицированном) учете в системе обязательного пенсионного страхования»;</p>
	<p class="terms-information">- Трудовой кодекс РФ и другими нормативно-правовыми актами.</p>
	<p class="terms-information">Сведениями, составляющими персональные данные, в Компании является любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</p>
  <h4 class="terms-label">2. Цели обработки персональных данных</h4>
	<p class="terms-information">Компания осуществляет обработку персональных данных в следующих целях:</p>
	<p class="terms-information">- организации кадрового учета компании;</p>
	<p class="terms-information">- обеспечения соблюдения законов и иных нормативно-правовых актов;</p>
	<p class="terms-information">- ведения кадрового делопроизводства;</p>
	<p class="terms-information">- исполнения требований налогового законодательства в связи с исчислением и уплатой налога на доходы физических лиц, а также единого социального налога, пенсионного законодательства при формировании и представлении персонифицированных данных о каждом получателе доходов, учитываемых при начислении страховых взносов на обязательное пенсионное страхование и обеспечение;</p>
	<p class="terms-information">- заполнения первичной статистической документации, в соответствии с Трудовым кодексом РФ, Налоговым кодексом РФ, федеральными законами, в частности: «Об индивидуальном (персонифицированном) учете в системе обязательного пенсионного страхования», «О персональных данных» и других нормативно-правовых актов;</p>
	<p class="terms-information">- исполнения договорных обязательств, в том числе гарантийного обслуживания потребителей услуг Компании;</p>
	<p class="terms-information">- иной деятельности в соответствии с Уставом Компании, действующим законодательством Российской федерации.</p>
  <h4 class="terms-label">3. Сроки обработки персональных данных</h4>
	<p class="terms-information">Сроки обработки персональных данных определяются в соответствие со сроком действия договора (соглашением) с субъектом персональных данных, сроком исковой давности, достижением целей обработки, а также иными требованиями законодательства РФ.
		<br />В Компании создаются и хранятся документы, содержащие сведения о субъектах персональных данных. Требования к использованию в Компании данных типовых форм документов установлены Постановлением Правительства РФ от 15.09.2008 № 687 «Об утверждении Положения об особенностях обработки персональных данных, осуществляемой без использования средств автоматизации».
	</p>
	<h4 class="terms-label">4. Права и обязанности</h4>
	<p class="terms-information">Компания как оператор персональных данных в праве:
	</p><p class="terms-information">- отстаивать свои интересы в суде;</p>
	<p class="terms-information">- предоставлять персональные данные субъектов третьим лицам, если это предусмотрено действующим законодательством (налоговые, правоохранительные органы и др.) или соглашением субъекта персональных данных;</p>
	<p class="terms-information">- отказывать в предоставлении персональных данных в случаях предусмотренных действующим законодательством;</p>
	<p class="terms-information">- использовать персональные данные субъекта без его согласия, в случаях предусмотренных законодательством.</p>
	<p class="terms-information">Субъект персональных данных имеет право:</p>
	<p class="terms-information">- требовать уточнения своих персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, недостоверными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;</p>
	<p class="terms-information">- требовать перечень своих персональных данных, обрабатываемых Компанией и источник их получения;</p>
	<p class="terms-information">- получать информацию о сроках обработки своих персональных данных, в том числе о сроках их хранения;</p>
	<p class="terms-information">- требовать извещения всех лиц, которым ранее были сообщены неверные или неполные его персональные данные, обо всех произведенных в них исключениях, исправлениях или дополнениях;</p>
	<p class="terms-information">- обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействия при обработке его персональных данных.</p>
	<h4 class="terms-label">5. Принципы и условия обработки персональных данных</h4>
	<p class="terms-information">Обработка персональных данных в Компании производится на основе соблюдения принципов:</p>
	<p class="terms-information">- законности целей и способов обработки персональных данных;</p>
	<p class="terms-information">- соответствия целей обработки персональных данных целям, заранее определенным и заявленным при сборе персональных данных;</p>
	<p class="terms-information">- соответствия объема и характера обрабатываемых персональных данных, способов обработки персональных данных целям обработки персональных данных;</p>
	<p class="terms-information">- достоверности персональных данных, их достаточности для целей обработки, недопустимости обработки персональных данных, избыточных по отношению к целям, заявленным при сборе персональных данных;</p>
	<p class="terms-information">- недопустимости объединения созданных для несовместимых между собой целей баз данных, содержащих персональные данные;</p>
	<p class="terms-information">- хранения персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели их обработки;</p>
	<p class="terms-information">- уничтожения по достижении целей обработки персональных данных или в случае утраты необходимости в их достижении.</p>
	<p class="terms-information">Отказ потребителя услуг Компании от предоставления согласия на обработку его персональных данных влечет за собой невозможность достижения целей обработки.</p>
  <h4 class="terms-label">6. Обеспечение безопасности персональных данных</h4>
  <p class="terms-information">Компания предпринимает необходимые организационные и технические меры для обеспечения безопасности персональных данных от случайного или несанкционированного доступа, уничтожения, изменения, блокирования доступа и других несанкционированных действий.
		<br />В целях координации действий по обеспечению безопасности персональных данных в Компании назначен ответственный за организацию защиты персональных данных.
	</p>
	<h4 class="terms-label">7. Заключительные положения</h4>
	<p class="terms-information">Настоящая Политика предназначена для размещения в информационных ресурсах общественного пользования Компании.
		<br />Настоящая Политика подлежит изменению, дополнению в случае появления новых законодательных актов и специальных нормативных документов по обработке и защите персональных данных, но не реже одного раза в три года.
	</p>
	<p class="terms-information">Контроль исполнения требований настоящей Политики осуществляется ответственным за организацию обработки персональных данных Компании.</p>
	<p class="terms-information">Ответственность должностных лиц Компании, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных, определяется в соответствии с законодательством Российской Федерации и внутренними документами Компании.</p>
</div>`
};


export const createTerms = () => {
  const terms = {
    showTerms: () => { },
  }

  class Terms extends Component {
    componentDidMount() {
      terms.showTerms = this.showTerms.bind(this);

      this.setState({
        show: false,
      });
    }
    showTerms() {
      this.setState({ show: true });
    }
    render({ }, { show }) {
      const onClose = () => this.setState({ show: false })
      return show ?
        html`<div class="modal">
          <div class="modal-content">
          <button class="close-button" onClick=${onClose}>✕</button>
           <${TermsOfService} />
          </div>
        </div>`:
        html`<div></div>`;
    }
  }

  render(html`<${Terms} />`, document.getElementById("terms"));
  return terms
};

